Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.message.copyQuestion
source: Copy question to clipboard and input
ar: نسخ السؤال إلى الحافظة والإدخال
de: Frage in die Zwischenablage kopieren und eingeben
es: Copiar pregunta al portapapeles e introducir
fr: Copier la question dans le presse-papiers et la saisir
id: Salin pertanyaan ke papan klip dan masukkan
it: Copia domanda negli appunti e inserisci
ja: 質問をクリップボードにコピーして入力
ko: 질문을 클립보드에 복사하고 입력
nl: Kopieer vraag naar klembord en invoer
pl: Kopiuj pytanie do schowka i wprowadź
pt_br: Copiar pergunta para a área de transferência e entrada
ru: Скопировать вопрос в буфер обмена и ввести
tr: Soruyu panoya kopyala ve gir
uk: Скопіювати запитання в буфер обміну та ввести
vi: Sao chép câu hỏi vào bảng tạm và nhập
zh_hans: 复制到剪贴板并回填输入框
zh_hant: 複製到剪貼簿並回填輸入框

# rag.workspace.message.copyQuestion.clipboard
source: Copy question
ar: نسخ السؤال
de: Frage kopieren
es: Copiar pregunta
fr: Copier la question
id: Salin pertanyaan
it: Copia domanda
ja: 質問をコピー
ko: 질문 복사
nl: Vraag kopiëren
pl: Kopiuj pytanie
pt_br: Copiar pergunta
ru: Скопировать вопрос
tr: Soruyu kopyala
uk: Скопіювати запитання
vi: Sao chép câu hỏi
zh_hans: 复制问题
zh_hant: 複製問題

# rag.workspace.message.editCancel
source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
id: Batal
it: Annulla
ja: キャンセル
ko: 취소
nl: Annuleer
pl: Anuluj
pt_br: Cancelar
ru: Отмена
tr: İptal
uk: Скасувати
vi: Hủy
zh_hans: 取消
zh_hant: 取消

# rag.workspace.message.editQuestion
source: Edit question
ar: تحرير السؤال
de: Frage bearbeiten
es: Editar pregunta
fr: Modifier la question
id: Edit pertanyaan
it: Modifica domanda
ja: 質問を編集
ko: 질문 편집
nl: Vraag bewerken
pl: Edytuj pytanie
pt_br: Editar pergunta
ru: Редактировать вопрос
tr: Soruyu düzenle
uk: Редагувати запитання
vi: Chỉnh sửa câu hỏi
zh_hans: 编辑问题
zh_hant: 編輯問題

# rag.workspace.message.editSend
source: Send
ar: إرسال
de: Senden
es: Enviar
fr: Envoyer
id: Kirim
it: Invia
ja: 送信
ko: 보내기
nl: Verzend
pl: Wyślij
pt_br: Enviar
ru: Отправить
tr: Gönder
uk: Надіслати
vi: Gửi
zh_hans: 发送
zh_hant: 傳送

# rag.workspace.message.processingDuration
source: Processed
ar: تمت المعالجة
de: Verarbeitet
es: Procesado
fr: Traité
id: Diproses
it: Elaborato
ja: 処理時間
ko: 처리됨
nl: Verwerkt
pl: Przetworzono
pt_br: Processado
ru: Обработано
tr: İşlendi
uk: Оброблено
vi: Đã xử lý
zh_hans: 已处理
zh_hant: 已處理

# rag.workspace.message.user
source: User
ar: المستخدم
de: Benutzer
es: Usuario
fr: Utilisateur
id: Pengguna
it: Utente
ja: ユーザ
ko: 사용자
nl: Gebruiker
pl: Użytkownik
pt_br: Usuário
ru: Пользователь
tr: Kullanıcı
uk: Користувач
vi: Người dùng
zh_hans: 用户
zh_hant: 使用者

# rag.workspace.network.noProvider
source: No External Search provider is available. Enable and verify one in Settings first.
ar: لا يتوفر مزود بحث خارجي. قم بتمكينه والتحقق منه في الإعدادات أولاً.
de: Kein externer Suchanbieter verfügbar. Aktiviere und verifiziere einen in den Einstellungen.
es: No hay ningún proveedor de búsqueda externa disponible. Actívalo y verifícalo primero en Ajustes.
fr: Aucun fournisseur de recherche externe disponible. Activez-en un dans Réglages d'abord.
id: Tidak ada penyedia Pencarian Eksternal yang tersedia. Aktifkan dan verifikasi satu di Pengaturan terlebih dahulu.
it: Nessun provider di ricerca esterna disponibile. Abilita e verifica prima nelle Impostazioni.
ja: 外部検索プロバイダが利用できません。設定で有効にして確認してください。
ko: 외부 검색 제공자를 사용할 수 없습니다. 먼저 설정에서 활성화하고 확인하세요.
nl: Geen externe zoekprovider beschikbaar. Schakel er een in en verifieer deze in Instellingen.
pl: Brak dostępnego dostawcy wyszukiwania zewnętrznego. Włącz i zweryfikuj go w Ustawieniach.
pt_br: Nenhum provedor de Pesquisa Externa disponível. Habilite e verifique um nas Configurações primeiro.
ru: Нет доступного провайдера внешнего поиска. Сначала включите и проверьте его в Настройках.
tr: Harici Arama sağlayıcısı mevcut değil. Önce Ayarlar'dan birini etkinleştirin ve doğrulayın.
uk: Немає доступного постачальника зовнішнього пошуку. Спочатку ввімкніть і перевірте його в налаштуваннях.
vi: Không có nhà cung cấp Tìm kiếm bên ngoài nào khả dụng. Hãy bật và xác minh một nhà cung cấp trong Cài đặt trước.
zh_hans: 没有可用的 External Search Provider，请先在设置中启用并验证。
zh_hant: 沒有可用的 External Search Provider，請先在設定中啟用並驗證。

# rag.workspace.network.reason.liveGitHub
source: The question asks for current GitHub data.
ar: السؤال يطلب بيانات GitHub الحالية.
de: Die Frage verlangt aktuelle GitHub-Daten.
es: La pregunta solicita datos actuales de GitHub.
fr: La question demande des données GitHub actuelles.
id: Pertanyaan meminta data GitHub saat ini.
it: La domanda richiede dati GitHub correnti.
ja: 質問が現在のGitHubデータを求めています。
ko: 질문이 현재 GitHub 데이터를 요청합니다.
nl: De vraag vraagt om actuele GitHub-gegevens.
pl: Pytanie dotyczy bieżących danych z GitHub.
pt_br: A pergunta solicita dados atuais do GitHub.
ru: Вопрос требует актуальных данных GitHub.
tr: Soru güncel GitHub verilerini istiyor.
uk: Запитання вимагає поточних даних GitHub.
vi: Câu hỏi yêu cầu dữ liệu GitHub hiện tại.
zh_hans: 问题需要 GitHub 当前实时数据。
zh_hant: 問題需要 GitHub 當前即時資料。

# rag.workspace.network.reason.userEnabled
source: Web search was explicitly enabled in the composer.
ar: تم تمكين البحث على الويب بشكل صريح في المحرر.
de: Websuche wurde im Composer explizit aktiviert.
es: La búsqueda web se habilitó explícitamente en el compositor.
fr: La recherche web a été explicitement activée dans le compositeur.
id: Pencarian web diaktifkan secara eksplisit di komposer.
it: La ricerca web è stata esplicitamente abilitata nel compositore.
ja: コンポーザーでWeb検索が明示的に有効化されました。
ko: 작성기에서 웹 검색이 명시적으로 활성화되었습니다.
nl: Webzoekopdracht is expliciet ingeschakeld in de composer.
pl: Wyszukiwanie internetowe zostało jawnie włączone w kompozytorze.
pt_br: A pesquisa na web foi ativada explicitamente no compositor.
ru: Веб-поиск был явно включён в компоновщике.
tr: Web araması, besteleyicide açıkça etkinleştirildi.
uk: Веб-пошук явно ввімкнено в композиторі.
vi: Tìm kiếm web đã được bật rõ ràng trong trình soạn thảo.
zh_hans: 用户已在输入框中主动开启联网搜索。
zh_hant: 使用者已在輸入框中主動開啟聯網搜尋。

# rag.workspace.newConversation
source: New conversation
ar: محادثة جديدة
de: Neue Unterhaltung
es: Nueva conversación
fr: Nouvelle conversation
id: Percakapan baru
it: Nuova conversazione
ja: 新しい会話
ko: 새 대화
nl: Nieuw gesprek
pl: Nowa rozmowa
pt_br: Nova conversa
ru: Новый разговор
tr: Yeni konuşma
uk: Нова розмова
vi: Cuộc trò chuyện mới
zh_hans: 新会话
zh_hant: 新對話

# rag.workspace.outline.jump
source: Jump to this turn
ar: الانتقال إلى هذا الدور
de: Zu diesem Abschnitt springen
es: Saltar a este turno
fr: Aller à ce tour
id: Lompat ke giliran ini
it: Vai a questo turno
ja: このターンにジャンプ
ko: 이 턴으로 이동
nl: Spring naar deze beurt
pl: Przejdź do tej tury
pt_br: Ir para este turno
ru: Перейти к этому витку
tr: Bu tura atla
uk: Перейти до цього кроку
vi: Chuyển đến lượt này
zh_hans: 跳转到该轮问答
zh_hant: 跳到該輪問答

# rag.workspace.prompt.placeholder.attachmentCount
source: Number of attachments attached to this turn.
ar: عدد المرفقات المرفقة بهذا الدور.
de: Anzahl der an diesen Abschnitt angehängten Anhänge.
es: Número de archivos adjuntos en este turno.
fr: Nombre de pièces jointes attachées à ce tour.
id: Jumlah lampiran yang dilampirkan pada giliran ini.
it: Numero di allegati allegati a questo turno.
ja: このターンに添付された添付ファイルの数。
ko: 이 턴에 첨부된 첨부 파일 수입니다.
nl: Aantal bijlagen dat aan deze beurt is toegevoegd.
pl: Liczba załączników dołączonych do tej tury.
pt_br: Número de anexos vinculados a este turno.
ru: Количество вложений, прикреплённых к этому витку.
tr: Bu tura eklenen ek sayısı.
uk: Кількість вкладень, прикріплених до цього кроку.
vi: Số lượng tệp đính kèm được gắn vào lượt này.
zh_hans: 本轮附件数量。
zh_hant: 本輪附件數量。

# rag.workspace.prompt.placeholder.attachmentDescriptors
source: Attachment filename, content type, and handling mode; no attachment body.
ar: اسم ملف المرفق، نوع المحتوى، ووضع المعالجة؛ بدون محتوى المرفق.
de: Dateiname, Inhaltstyp und Verarbeitungsmodus des Anhangs; kein Anhangstext.
es: Nombre del archivo adjunto, tipo de contenido y modo de manejo; sin el cuerpo del adjunto.
fr: Nom du fichier, type de contenu et mode de traitement de la pièce jointe ; pas de corps de pièce jointe.
id: Nama file lampiran, jenis konten, dan mode penanganan; tanpa badan lampiran.
it: Nome file allegato, tipo di contenuto e modalità di gestione; nessun corpo allegato.
ja: 添付ファイルのファイル名、コンテンツタイプ、処理モード。添付本文は含まれません。
ko: 첨부 파일 이름, 콘텐츠 유형 및 처리 모드; 첨부 파일 본문은 포함되지 않습니다.
nl: Bestandsnaam, inhoudstype en verwerkingsmodus van bijlage; geen bijlagetekst.
pl: Nazwa pliku załącznika, typ zawartości i tryb obsługi; brak treści załącznika.
pt_br: Nome do arquivo do anexo, tipo de conteúdo e modo de manipulação; sem o corpo do anexo.
ru: Имя файла вложения, тип содержимого и режим обработки; без тела вложения.
tr: Ek dosya adı, içerik türü ve işleme modu; ek gövdesi yok.
uk: Ім'я файлу, тип вмісту та режим обробки вкладення; без тіла вкладення.
vi: Tên tệp đính kèm, loại nội dung và chế độ xử lý; không có nội dung tệp đính kèm.
zh_hans: 附件文件名、内容类型与处理方式，不包含附件正文。
zh_hant: 附件檔名、內容類型與處理方式，不包含附件正文。

# rag.workspace.prompt.placeholder.attachmentSection
source: User attachment text for this turn. Empty when there are no attachments.
ar: نص مرفق المستخدم لهذا الدور. فارغ عندما لا توجد مرفقات.
de: Benutzer-Anhangstext für diesen Abschnitt. Leer, wenn keine Anhänge vorhanden.
es: Texto del adjunto del usuario para este turno. Vacío cuando no hay adjuntos.
fr: Texte de la pièce jointe utilisateur pour ce tour. Vide s'il n'y a pas de pièces jointes.
id: Teks lampiran pengguna untuk giliran ini. Kosong jika tidak ada lampiran.
it: Testo dell'allegato utente per questo turno. Vuoto quando non ci sono allegati.
ja: このターンのユーザ添付テキスト。添付ファイルがない場合は空文字列。
ko: 이 턴의 사용자 첨부 파일 텍스트입니다. 첨부 파일이 없으면 비어 있습니다.
nl: Gebruikerbijlagetekst voor deze beurt. Leeg als er geen bijlagen zijn.
pl: Tekst załącznika użytkownika dla tej tury. Pusty, gdy brak załączników.
pt_br: Texto do anexo do usuário para este turno. Vazio quando não há anexos.
ru: Текст вложения пользователя для этого витка. Пусто, если вложений нет.
tr: Bu tur için kullanıcı ek metni. Ek yoksa boş.
uk: Текст вкладення користувача для цього кроку. Порожньо, якщо вкладень немає.
vi: Văn bản tệp đính kèm của người dùng cho lượt này. Trống khi không có tệp đính kèm.
zh_hans: 本轮用户附件文本；无附件时为空。
zh_hant: 本輪使用者附件文字；無附件時為空。

# rag.workspace.prompt.placeholder.evidenceSection
source: Local knowledge-base chunks. Empty string when there are no chunks.
ar: أجزاء قاعدة المعرفة المحلية. سلسلة فارغة عندما لا توجد أجزاء.
de: Lokale Wissensdatenbank-Ausschnitte. Leerer String, wenn keine Ausschnitte vorhanden.
es: Fragmentos de la base de conocimiento local. Cadena vacía cuando no hay fragmentos.
fr: Fragments de la base de connaissances locale. Chaîne vide s'il n'y a pas de fragments.
id: Potongan basis pengetahuan lokal. String kosong jika tidak ada potongan.
it: Blocchi della knowledge base locale. Stringa vuota quando non ci sono blocchi.
ja: ローカルナレッジベースのチャンク。チャンクがない場合は空文字列。
ko: 로컬 지식 베이스 청크입니다. 청크가 없으면 빈 문자열입니다.
nl: Lokale kennisbankfragmenten. Lege string als er geen fragmenten zijn.
pl: Fragmenty lokalnej bazy wiedzy. Pusty ciąg, gdy brak fragmentów.
pt_br: Trechos da base de conhecimento local. String vazia quando não há trechos.
ru: Фрагменты локальной базы знаний. Пустая строка, если фрагментов нет.
tr: Yerel bilgi tabanı parçaları. Parça yoksa boş dize.
uk: Фрагменти локальної бази знань. Порожній рядок, якщо фрагментів немає.
vi: Các đoạn cơ sở tri thức cục bộ. Chuỗi rỗng khi không có đoạn nào.
zh_hans: 本地知识库分片；无分片时注入空字符串。
zh_hant: 本地知識庫分片；無分片時注入空字串。

# rag.workspace.prompt.placeholder.existingSummarySection
source: Existing conversation digest section. Empty string when there is no prior summary.
ar: قسم ملخص المحادثة الحالي. سلسلة فارغة عندما لا يوجد ملخص سابق.
de: Bestehender Zusammenfassungsabschnitt der Unterhaltung. Leerer String, wenn keine vorherige Zusammenfassung vorhanden.
es: Sección de resumen de la conversación existente. Cadena vacía cuando no hay resumen previo.
fr: Section du résumé de la conversation existante. Chaîne vide s'il n'y a pas de résumé précédent.
id: Bagian ringkasan percakapan yang ada. String kosong jika tidak ada ringkasan sebelumnya.
it: Sezione di riepilogo della conversazione esistente. Stringa vuota quando non c'è un riepilogo precedente.
ja: 既存の会話ダイジェストセクション。以前のサマリーがない場合は空文字列。
ko: 기존 대화 요약 섹션입니다. 이전 요약이 없으면 빈 문자열입니다.
nl: Bestaand gesprekssamenvattingsgedeelte. Lege string als er geen eerdere samenvatting is.
pl: Sekcja podsumowania istniejącej rozmowy. Pusty ciąg, gdy brak wcześniejszego podsumowania.
pt_br: Seção de resumo da conversa existente. String vazia quando não há resumo anterior.
ru: Раздел сводки существующего разговора. Пустая строка, если нет предыдущей сводки.
tr: Mevcut konuşma özeti bölümü. Önceki özet yoksa boş dize.
uk: Розділ існуючого дайджесту розмови. Порожній рядок, якщо попереднього підсумку немає.
vi: Phần tóm tắt cuộc trò chuyện hiện có. Chuỗi rỗng khi không có tóm tắt trước đó.
zh_hans: 已有会话摘要段落；无摘要时注入空字符串。
zh_hant: 已有對話摘要段落；無摘要時注入空字串。

# rag.workspace.prompt.placeholder.explicitRepoIDs
source: Comma-separated repo IDs explicitly scoped in Composer.
ar: معرفات المستودعات المفصولة بفواصل والمحددة بشكل صريح في المحرر.
de: Kommagetrennte Repo-IDs, die im Composer explizit festgelegt wurden.
es: IDs de repositorio separados por coma, explícitamente definidos en el Compositor.
fr: Identifiants de dépôts séparés par des virgules, explicitement définis dans le compositeur.
id: ID repositori yang dipisahkan koma yang secara eksplisit dibatasi di Komposer.
it: ID repository separati da virgola esplicitamente limitati nel Compositore.
ja: コンポーザーで明示的にスコープされたリポジトリIDのカンマ区切りリスト。
ko: 작성기에서 명시적으로 범위가 지정된 저장소 ID(쉼표로 구분)입니다.
nl: Komma-gescheiden repo-ID's die expliciet zijn ingesteld in Composer.
pl: Identyfikatory repozytoriów oddzielone przecinkami, jawnie określone w kompozytorze.
pt_br: IDs de repositórios explícitos separados por vírgula, definidos no Compositor.
ru: Идентификаторы репозиториев, разделённые запятыми, явно указанные в компоновщике.
tr: Besteleyicide açıkça kapsamlanmış virgülle ayrılmış depo kimlikleri.
uk: Ідентифікатори репозиторіїв, розділені комами, явно вказані в композиторі.
vi: ID kho lưu trữ được phân tách bằng dấu phẩy được xác định rõ ràng trong Trình soạn thảo.
zh_hans: Composer 中明确指定的仓库 ID（逗号分隔）。
zh_hant: Composer 中明確指定的倉庫 ID（逗號分隔）。

# rag.workspace.prompt.placeholder.explicitRepoMode
source: How explicit repos constrain planning (for understanding only; executor re-enforces).
ar: كيف تقيد المستودعات الصريحة التخطيط (للفهم فقط؛ المنفذ يعيد التأكيد).
de: Wie explizite Repos die Planung einschränken (nur zum Verständnis; der Ausführer setzt durch).
es: Cómo los repos explícitos restringen la planificación (solo para comprensión; el ejecutor lo refuerza).
fr: Comment les dépôts explicites contraignent la planification (pour compréhension uniquement ; l'exécuteur renforce).
id: Bagaimana repositori eksplisit membatasi perencanaan (hanya untuk pemahaman; eksekutor menegakkan kembali).
it: Come i repository espliciti vincolano la pianificazione (solo per comprensione; l'esecutore li rafforza).
ja: 明示的リポジトリが計画を制約する方法（理解用。実行時に再適用）。
ko: 명시적 저장소가 계획을 제한하는 방식입니다(이해 전용; 실행기가 재적용).
nl: Hoe expliciete repos de planning beperken (alleen ter informatie; executor handhaaft).
pl: Sposób, w jaki jawne repozytoria ograniczają planowanie (tylko do zrozumienia; wykonawca egzekwuje).
pt_br: Como os repositórios explícitos restringem o planejamento (apenas para compreensão; o executor reforça).
ru: Как явные репозитории ограничивают планирование (только для понимания; исполнитель применяет повторно).
tr: Açık depoların planlamayı nasıl kısıtladığı (yalnızca anlama için; yürütücü tekrar uygular).
uk: Як явні репозиторії обмежують планування (лише для розуміння; виконавець забезпечує виконання).
vi: Cách các kho lưu trữ rõ ràng ràng buộc việc lập kế hoạch (chỉ để hiểu; trình thực thi thực thi lại).
zh_hans: 明确仓库范围如何约束规划（仅供理解；本地执行器会再强制）。
zh_hant: 明確倉庫範圍如何約束規劃（僅供理解；本地執行器會再強制）。

# rag.workspace.prompt.placeholder.explicitRepositories
source: Explicit repo IDs and full names selected in Composer.
ar: معرفات المستودعات الصريحة والأسماء الكاملة المحددة في المحرر.
de: Explizite Repo-IDs und vollständige Namen, die im Composer ausgewählt wurden.
es: IDs y nombres completos de repositorios explícitos seleccionados en el Compositor.
fr: Identifiants et noms complets des dépôts explicites sélectionnés dans le compositeur.
id: ID repositori eksplisit dan nama lengkap yang dipilih di Komposer.
it: ID repository espliciti e nomi completi selezionati nel Compositore.
ja: コンポーザーで選択された明示的リポジトリのIDとフルネーム。
ko: 작성기에서 선택한 명시적 저장소 ID와 전체 이름입니다.
nl: Expliciete repo-ID's en volledige namen geselecteerd in Composer.
pl: Jawne identyfikatory repozytoriów i pełne nazwy wybrane w kompozytorze.
pt_br: IDs e nomes completos dos repositórios explícitos selecionados no Compositor.
ru: Явные идентификаторы и полные имена репозиториев, выбранные в компоновщике.
tr: Besteleyicide seçilen açık depo kimlikleri ve tam adları.
uk: Явні ідентифікатори та повні назви репозиторіїв, вибрані в композиторі.
vi: ID kho lưu trữ rõ ràng và tên đầy đủ được chọn trong Trình soạn thảo.
zh_hans: Composer 中明确选择的仓库 ID 与完整名称。
zh_hant: Composer 中明確選擇的倉庫 ID 與完整名稱。

# rag.workspace.prompt.placeholder.firstQuestion
source: The first user question used to generate the conversation title.
ar: أول سؤال مستخدم تم استخدامه لإنشاء عنوان المحادثة.
de: Die erste Benutzerfrage, die zur Generierung des Unterhaltungstitels verwendet wurde.
es: La primera pregunta del usuario utilizada para generar el título de la conversación.
fr: La première question utilisateur utilisée pour générer le titre de la conversation.
id: Pertanyaan pengguna pertama yang digunakan untuk menghasilkan judul percakapan.
it: La prima domanda utente usata per generare il titolo della conversazione.
ja: 会話タイトル生成に使用された最初のユーザ質問。
ko: 대화 제목을 생성하는 데 사용된 첫 번째 사용자 질문입니다.
nl: De eerste gebruikersvraag die is gebruikt om de gesprekstitel te genereren.
pl: Pierwsze pytanie użytkownika użyte do wygenerowania tytułu rozmowy.
pt_br: A primeira pergunta do usuário usada para gerar o título da conversa.
ru: Первый вопрос пользователя, использованный для создания заголовка разговора.
tr: Konuşma başlığını oluşturmak için kullanılan ilk kullanıcı sorusu.
uk: Перше запитання користувача, використане для створення назви розмови.
vi: Câu hỏi đầu tiên của người dùng được sử dụng để tạo tiêu đề cuộc trò chuyện.
zh_hans: 用于生成会话标题的首个用户问题原文。
zh_hant: 用於產生對話標題的首個使用者問題原文。

# rag.workspace.prompt.placeholder.newMessagesSection
source: New messages to merge, with User/Assistant role labels built by the app.
ar: رسائل جديدة للدمج، مع تسميات دور المستخدم/المساعد المبنية بواسطة التطبيق.
de: Neue Nachrichten zum Zusammenführen, mit von der App erstellten Rollenlabels Benutzer/Assistent.
es: Nuevos mensajes para fusionar, con etiquetas de rol Usuario/Asistente añadidas por la app.
fr: Nouveaux messages à fusionner, avec les étiquettes de rôle Utilisateur/Assistant construites par l'application.
id: Pesan baru untuk digabungkan, dengan label peran Pengguna/Asisten yang dibuat oleh aplikasi.
it: Nuovi messaggi da unire, con etichette di ruolo Utente/Assistente costruite dall'app.
ja: マージする新しいメッセージ。アプリがUser/Assistantロールラベルを付与。
ko: 병합할 새 메시지로, 앱에서 생성된 사용자/어시스턴트 역할 레이블이 포함됩니다.
nl: Nieuwe berichten om samen te voegen, met door de app gegenereerde Gebruiker/Assistent-rol labels.
pl: Nowe wiadomości do scalenia, z etykietami roli Użytkownik/Asystent zbudowanymi przez aplikację.
pt_br: Novas mensagens a serem mescladas, com rótulos de função Usuário/Assistente criados pelo app.
ru: Новые сообщения для слияния с метками ролей Пользователь/Ассистент, созданными приложением.
tr: Birleştirilecek yeni mesajlar, uygulama tarafından oluşturulan Kullanıcı/Asistan rol etiketleriyle.
uk: Нові повідомлення для об'єднання з мітками ролей Користувач/Асистент, створеними програмою.
vi: Tin nhắn mới cần hợp nhất, với nhãn vai trò Người dùng/Trợ lý do ứng dụng xây dựng.
zh_hans: 待合并的新增对话；User/Assistant 角色标签由应用拼装。
zh_hant: 待合併的新增對話；User/Assistant 角色標籤由應用程式拼裝。

# rag.workspace.prompt.placeholder.outputLanguage
source: Display language for the final answer (from Settings → Language).
ar: لغة العرض للإجابة النهائية (من الإعدادات → اللغة).
de: Anzeigesprache für die endgültige Antwort (aus Einstellungen → Sprache).
es: Idioma de visualización para la respuesta final (de Ajustes → Idioma).
fr: Langue d'affichage pour la réponse finale (depuis Réglages → Langue).
id: Bahasa tampilan untuk jawaban akhir (dari Pengaturan → Bahasa).
it: Lingua di visualizzazione per la risposta finale (da Impostazioni → Lingua).
ja: 最終回答の表示言語（設定→言語から）。
ko: 최종 답변의 표시 언어입니다(설정 → 언어).
nl: Weergavetaal voor het uiteindelijke antwoord (uit Instellingen → Taal).
pl: Język wyświetlania ostatecznej odpowiedzi (z Ustawień → Język).
pt_br: Idioma de exibição para a resposta final (de Configurações → Idioma).
ru: Язык отображения окончательного ответа (из Настроек → Язык).
tr: Son yanıt için görüntüleme dili (Ayarlar → Dil'den).
uk: Мова відображення остаточної відповіді (з Налаштувань → Мова).
vi: Ngôn ngữ hiển thị cho câu trả lời cuối cùng (từ Cài đặt → Ngôn ngữ).
zh_hans: 最终回答的显示语言（来自设置 → 语言）。
zh_hant: 最終回答的顯示語言（來自設定 → 語言）。

# rag.workspace.prompt.placeholder.outputLanguageCompressor
source: Display language for the compressed digest (from Settings → Language).
ar: لغة العرض للملخص المضغوط (من الإعدادات → اللغة).
de: Anzeigesprache für die komprimierte Zusammenfassung (aus Einstellungen → Sprache).
es: Idioma de visualización para el resumen comprimido (de Ajustes → Idioma).
fr: Langue d'affichage pour le résumé compressé (depuis Réglages → Langue).
id: Bahasa tampilan untuk ringkasan yang dikompresi (dari Pengaturan → Bahasa).
it: Lingua di visualizzazione per il riepilogo compresso (da Impostazioni → Lingua).
ja: 圧縮ダイジェストの表示言語（設定→言語から）。
ko: 압축된 요약의 표시 언어입니다(설정 → 언어).
nl: Weergavetaal voor de gecomprimeerde samenvatting (uit Instellingen → Taal).
pl: Język wyświetlania skompresowanego podsumowania (z Ustawień → Język).
pt_br: Idioma de exibição para o resumo comprimido (de Configurações → Idioma).
ru: Язык отображения сжатой сводки (из Настроек → Язык).
tr: Sıkıştırılmış özet için görüntüleme dili (Ayarlar → Dil'den).
uk: Мова відображення стисненого дайджесту (з Налаштувань → Мова).
vi: Ngôn ngữ hiển thị cho bản tóm tắt nén (từ Cài đặt → Ngôn ngữ).
zh_hans: 压缩摘要的显示语言（来自设置 → 语言）。
zh_hant: 壓縮摘要的顯示語言（來自設定 → 語言）。
